IDENTIFICATION DIVISION.
PROGRAM-ID.  AcceptAndDisplay.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A PIC 9(1).
01 B PIC 9(1).

PROCEDURE DIVISION.
Begin.
       MOVE 2 TO A.
       ADD 2 TO A.
       DISPLAY A.
       MOVE 3 TO B.
       ADD 10 TO B.
       DISPLAY B.
       ADD A B GIVING A.
       DISPLAY A.
