       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       *> 01 DATAPACK.
           *> 02 NUM1 PIC S9(2) VALUE -1.
           *> 02 TEXT1 PIC XXX VALUE SPACES.
       01 NUM1 PIC 99.
       *> 01 NUM2 PIC 99 VALUE 99.
       PROCEDURE DIVISION.
       *> COMPUTE NUM1= NUM1 + 1000.
       MOVE 'h3' TO NUM1.
       ADD 1 TO NUM1 GIVING NUM1.
       DISPLAY NUM1.
