IDENTIFICATION DIVISION.
PROGRAM-ID.  AcceptAndDisplay.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A PIC 9.
01 B PIC 9.
01 C PIC 99.
01 D PIC 999.

PROCEDURE DIVISION.
Begin.
    MOVE 2 TO A.
    ADD 2 TO A.
    DISPLAY A.
    MOVE 3 TO B.
    ADD 10 TO B.
    DISPLAY B.
    ADD A B GIVING A.
    DISPLAY A.

    MOVE 2 TO A.
    MOVE 1 TO B.
    MULTIPLY 2 BY A.
    DISPLAY A.
    MULTIPLY 5 BY B.
    DISPLAY B.
    MULTIPLY A BY B GIVING C.
    MULTIPLY A BY B GIVING D.
    DISPLAY C.
    DISPLAY D.
