       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-X PIC 9(3) VALUE 5.
       01 WS-Y PIC 9(3) VALUE 6.
       PROCEDURE DIVISION.

       DISPLAY "abc" WITH NO ADVANCING.
       DISPLAY "BCD".

