       IDENTIFICATION DIVISION.
       PROGRAM-ID. DISPLAYWITHNOADV.

       PROCEDURE DIVISION.
       DISplay "abc" WITH NO ADVANCING.
       DISPLAY "BCD".
