IDENTIFICATION DIVISION.
PROGRAM-ID.  MoveData.

DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 A PIC 9.

PROCEDURE DIVISION.
    MOVE 555 TO A.
    DISPLAY A.
