IDENTIFICATION DIVISION.
PROGRAM-ID.  AcceptAndDisplay.

PROCEDURE DIVISION.
    PERFORM Hello 10 TIMES.
    STOP RUN.

    Hello.
    DISPLAY "HELLO WORLD".
