       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.
       PROCEDURE DIVISION.
       Runner SECTION.
       DISPLAY "HELLO WORLD".
       DISPLAY "HELLO WORLD".
       Greeting.
       DISPLAY "HELLO WORLD".
